shift to puml over mermaid
